lvx/base/Tasks/бит_Задача.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Task>
		<Properties>
			<Name>бит_Задача</Name>
			<Addressing>InformationRegister.бит_ИсполнителиЗадач</Addressing>
			<BasedOn>
				<xr:Item>Document.бит_ФормаВводаБюджета</xr:Item>
				<xr:Item>Document.бит_БюджетнаяОперация</xr:Item>
				<xr:Item>Document.бит_КорректировкаБюджета</xr:Item>
				<xr:Item>Document.бит_АктуализацияБюджета</xr:Item>
				<xr:Item>Document.бит_РаспределениеБюджета</xr:Item>
				<xr:Item>Document.бит_УстановкаЗависимыхОборотов</xr:Item>
				<xr:Item>Document.бит_УстановкаКонтрольныхЗначений</xr:Item>
				<xr:Item>Document.бит_КорректировкаКонтрольныхЗначений</xr:Item>
				<xr:Item>Document.бит_ПолучениеФактическихДанных</xr:Item>
				<xr:Item>Document.бит_ОперацияБюджетирование</xr:Item>
				<xr:Item>Catalog.бит_Бюджеты</xr:Item>
				<xr:Item>Catalog.бит_СтатьиОборотов</xr:Item>
				<xr:Item>Catalog.Проекты</xr:Item>
				<xr:Item>Catalog.бит_НастройкиФормВводаБюджета</xr:Item>
				<xr:Item>Catalog.бит_НастройкиРаспределенияБюджета</xr:Item>
				<xr:Item>Catalog.бит_ЭлементыДанных</xr:Item>
				<xr:Item>Catalog.Подразделения</xr:Item>
				<xr:Item>Document.бит_ДополнительныеУсловияПоДоговору</xr:Item>
				<xr:Item>Document.бит_УстановкаНеснижаемыхОстатков</xr:Item>
				<xr:Item>Document.бит_СведенияОбОстаткахДенежныхСредств</xr:Item>
				<xr:Item>Document.бит_кзн_ЗаявкаНаПереводСредствВДругуюОрганизацию</xr:Item>
				<xr:Item>Document.бит_кзн_ЗаявкаНаПеремещениеДенежныхСредств</xr:Item>
				<xr:Item>Document.бит_кзн_ЗаявкаНаРасходованиеСредств</xr:Item>
				<xr:Item>Document.бит_кзн_ПланируемоеПоступлениеДенежныхСредств</xr:Item>
				<xr:Item>Catalog.СценарииПланирования</xr:Item>
				<xr:Item>Document.бит_ПротоколРасхожденийБюджета</xr:Item>
				<xr:Item>Document.бит_УстановкаЗначенийПроизвольныхПараметров</xr:Item>
			</BasedOn>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Comment>Автор</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Важность</Name>
					<Comment>Важность</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыВажностиЗадач</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СрокИсполнения</Name>
					<Comment>Срок исполнения задачи</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаПринятияКИсполнению</Name>
					<Comment>Дата принятия к исполнению</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаНачалаИсполнения</Name>
					<Comment>Дата начала исполнения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОкончанияИсполнения</Name>
					<Comment>Дата окончания исполнения</Comment>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Описание</Name>
					<Comment>Описание задачи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>РезультатВыполнения</Name>
					<Comment>Результат выполнения задачи</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Предмет</Name>
					<Comment>Предмет</Comment>
					<Type>
						<v8:Type>cfg:TaskRef.бит_Задача</v8:Type>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:ChartOfCharacteristicTypesRef</v8:TypeSet>
						<v8:TypeSet>cfg:CatalogRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Состояние</Name>
					<Comment>Состояние</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СостояниеПредыдущее</Name>
					<Comment>Состояние предыдущее</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЗадачаОснование</Name>
					<Comment>Задача основание</Comment>
					<Type>
						<v8:Type>cfg:TaskRef.бит_Задача</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АлгоритмыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АлгоритмПодчиненный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АлгоритмыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТочкаАлгоритма</Name>
					<Comment>Точка алгоритма</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_ТочкиАлгоритмов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ЭтоПроверочнаяЗадача</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Виза</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_Визы</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>НаПроверку</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Задача</Name>
							<Type>
								<v8:Type>cfg:TaskRef.бит_Задача</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Принято</Name>
							<Comment>Принято</Comment>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Комментарий</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<AddressingAttribute>
				<Properties>
					<Name>Исполнитель</Name>
					<Comment>Исполнитель</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>РольИсполнителя</Name>
					<Comment>Роль исполнителя</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_РолиИсполнителей</v8:Type>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>ОбъектАдресации_1</Name>
					<Comment>Объект адресации № 1</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыОбъектовАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>ОбъектАдресации_2</Name>
					<Comment>Объект адресации № 2</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыОбъектовАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</AddressingAttribute>
			<AddressingAttribute>
				<Properties>
					<Name>ОбъектАдресации_3</Name>
					<Comment>Объект адресации № 3</Comment>
					<Type>
						<v8:TypeSet>cfg:Characteristic.бит_ВидыОбъектовАдресацииЗадач</v8:TypeSet>
					</Type>
				</Properties>
			</AddressingAttribute>
		</ChildObjects>
	</Task>
</MetaDataObject>

lvx/base/InformationRegisters/бит_ИсторияИзмененияСтатусовОбъектов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>бит_ИсторияИзмененияСтатусовОбъектов</Name>
			<Comment>(БИТ)</Comment>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Статус</Name>
					<Comment>Статус</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_СтатусыОбъектов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Пользователь</Name>
					<Comment>Пользователь</Comment>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Алгоритм</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.бит_АлгоритмыПроцессов</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Объект</Name>
					<Comment>Объект</Comment>
					<Type>
						<v8:TypeSet>cfg:DefinedType.бит_ОбъектыСоСтатусами</v8:TypeSet>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ВидСтатуса</Name>
					<Comment>Вид статуса</Comment>
					<Type>
						<v8:Type>cfg:EnumRef.бит_ВидыСтатусовОбъектов</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

lvx/base/Enums/бит_фн_ВидыСобытийОповещений.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>бит_фн_ВидыСобытийОповещений</Name>
			<Comment>(БИТ)</Comment>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>ДокументыДляВизирования</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ДоступнаВиза</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписанДокумент</Name>
					<Comment>Записан документ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаписанСправочник</Name>
					<Comment>Записан справочник</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмененоСостояниеЗадачи</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмененоСостояниеПроцесса</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НапоминанияПоГрафикуНачислений</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НапоминанияПоГрафикуПлатежей</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОкончаниеСрокаДействияДоговора</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ОтмененоПроведениеДокумента</Name>
					<Comment>Отменено проведение документа</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПринятоРешение</Name>
					<Comment>Принято решение</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ПроведенДокумент</Name>
					<Comment>Проведен документ</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>УстановленСтатус</Name>
					<Comment>Установлен статус</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ИзмененаДатаПлатежа</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НапоминанияОбОплате</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

lvx/base/Tasks/бит_Задача/Ext/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	ДополнительныеСвойства.Вставить("ЭтоНовый", ЭтоНовый());
	
	Если ОбменДанными.Загрузка = Истина Тогда
		Возврат;
	КонецЕсли; 
	
	Если ПометкаУдаления <> Ссылка.ПометкаУдаления 
		 И ЗначениеЗаполнено(Алгоритм)  Тогда
		// Синхронизацию задач выполняем только для задач, включенных в процесс, 
		// т.к. в задачах генерируемых процессами предметы могут создаваться автоматически,
		// а в задачах созданных вручную можно только привязать существующий предмет.
		ДополнительныеСвойства.Вставить("СинхронизироватьПометку");
		Возврат;
	КонецЕсли; 
	
	Если ЗначениеЗаполнено(БизнесПроцесс) И Выполнена = Ложь И Ссылка.Выполнена = Истина Тогда
		ДополнительныеСвойства.Вставить("ОтменаВыполнения");
	КонецЕсли; 
	
	Если Состояние <> Ссылка.Состояние Тогда
		ДополнительныеСвойства.Вставить("ИзмененоСостояние");
	КонецЕсли; 
	
	Если ДополнительныеСвойства.Свойство("ВыполнениеАвтоматически") Тогда
		 Выполнена = Истина;
		 Состояние = Справочники.бит_СтатусыОбъектов.Задача_Выполнена;
		 СостояниеПредыдущее = Справочники.бит_СтатусыОбъектов.Задача_Создана;
	КонецЕсли; 
	
КонецПроцедуры

Процедура ПриВыполнении(Отказ)
	
	Если НЕ Отказ Тогда
		// При завершении подчиненного процесса признак Выполнена ставится автоматически
		// в этом случае установим состояние Задача_Выполнена.
		Если ЗначениеЗаполнено(АлгоритмПодчиненный) И Выполнена Тогда
			 Состояние = Справочники.бит_СтатусыОбъектов.Задача_Выполнена;
			 ДатаОкончанияИсполнения = ТекущаяДатаСеанса();
		КонецЕсли; 
		
		Если ЗначениеЗаполнено(БизнесПроцесс) Тогда
			ПараметрыДеактивации = бит_УправлениеПроцессами.НовыеПараметрыДеактивации();
			ПараметрыДеактивации.ТекущаяТочка  = ТочкаАлгоритма;
			ПараметрыДеактивации.Алгоритм      = Алгоритм;
			ПараметрыДеактивации.БизнесПроцесс = БизнесПроцесс;
			бит_УправлениеПроцессами.ДеактивироватьНижестоящиеЗадачи(ПараметрыДеактивации);
			
			ДополнительныеСвойства.Вставить("Выполнение");
		КонецЕсли; 
	КонецЕсли; 

КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Истина);
	
	Если НЕ Отказ Тогда
		
		// Выполнение старта подчиненного процесса
		Если ЭтоВедущаяЗадача() Тогда
			
			ПроцессПодчиненный = НайтиПодчиненныйПроцесс(Неопределено);			
			Если НЕ ЗначениеЗаполнено(ПроцессПодчиненный) Тогда				
				Задачи.бит_Задача.СоздатьПодчиненныйБизнесПроцесс(Ссылка, Истина, "Ошибки");				
			КонецЕсли; 
			
		КонецЕсли; 
		
		Если ДополнительныеСвойства.Свойство("ИзмененоСостояние") Тогда			
			СохранитьИсторию();
			ВыполнитьРегистрациюСобытийДляОповещений(Отказ);			
			ДополнительныеСвойства.Удалить("ИзмененоСостояние");			
		КонецЕсли; 
		
		// Синхронизация пометки удаления у предмета и задачи, а также у подчиненного процесса.
		Если ДополнительныеСвойства.Свойство("СинхронизироватьПометку") Тогда
			
			Если ЗначениеЗаполнено(Предмет) Тогда
				
				Если Метаданные.Документы.Содержит(Предмет.Метаданные())
					И ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Предмет, "Проведен") Тогда
					
					ТекстСообщения = НСтр("ru = 'Предмет задачи %1 проведен. 
										|Для удаление задачи необходимо отменить проведение документа.';
										|en = 'Subject of task%1 completed.
										|To delete a task, you must cancel the document.'");
					ТекстСообщения = СтрШаблон(ТекстСообщения, Предмет);
					ОбщегоНазначения.СообщитьПользователю(ТекстСообщения,,,,Отказ);
					Возврат;
				КонецЕсли;
				
				бит_ОбщегоНазначения.ИзменитьПометкуНаУдалениеУОбъекта(Предмет,
				ПометкаУдаления, , "Ошибки", Новый Структура("ОшибкуПодробно"));
				
				
			КонецЕсли; 
			
			ПроцессПодчиненный = НайтиПодчиненныйПроцесс(ПроцессПодчиненный);
			Если ЗначениеЗаполнено(ПроцессПодчиненный) Тогда				
				бит_ОбщегоНазначения.ИзменитьПометкуНаУдалениеУОбъекта(ПроцессПодчиненный,
										ПометкаУдаления, , "Ошибки", Новый Структура("ОшибкуПодробно"));			
			КонецЕсли; 
			
			ДополнительныеСвойства.Удалить("СинхронизироватьПометку");
			
		КонецЕсли; // Синхронизация пометки
		
		// Остановка подчиненного процесса
		Если ЭтоВедущаяЗадача() И ДополнительныеСвойства.Свойство("Остановить") Тогда
			
			ПроцессПодчиненный = НайтиПодчиненныйПроцесс(ПроцессПодчиненный);			
			Если ЗначениеЗаполнено(ПроцессПодчиненный) Тогда			
				БизнесПроцессы.бит_Процесс.ОстановитьПроцесс(ПроцессПодчиненный);			
			КонецЕсли; 
			
			ДополнительныеСвойства.Удалить("Остановить");
		
		КонецЕсли; 
		
		// Продолжение подчиненного процесса
		Если ЭтоВедущаяЗадача() И ДополнительныеСвойства.Свойство("Продолжить") Тогда
			
			ПроцессПодчиненный = НайтиПодчиненныйПроцесс(ПроцессПодчиненный);			
			Если ЗначениеЗаполнено(ПроцессПодчиненный) Тогда			
				БизнесПроцессы.бит_Процесс.ПродолжитьПроцесс(ПроцессПодчиненный);			
			КонецЕсли; 
			
			ДополнительныеСвойства.Свойство("Продолжить");
		
		КонецЕсли; 
		
		// Создание задач процесса
		Если ДополнительныеСвойства.Свойство("Выполнение") Тогда
			
			// Событие бизнес-процесса "ПередСозданиемЗадач" возникает, только после выполнения последней 
			// задачи в точке маршрута бизнес-процесса. А точка маршрута типа ТочкаДействия в бизнес-процессе 
			// бит_Процесс только одна. Поэтому если в процессе есть невыполненные задачи, необходимо выполнить 
			// создание последующих задач процесса из модуля задачи.
			Исключения = Новый Массив;
			Исключения.Добавить(Ссылка);
			флЕстьНевыполненные = БизнесПроцессы.бит_Процесс.ЕстьНевыполненныеЗадачи(БизнесПроцесс, Исключения);
			
			Если флЕстьНевыполненные Тогда				
				ФормируемыеЗадачи = Новый Массив;
				БизнесПроцессы.бит_Процесс.СоздатьЗадачиПроцесса(БизнесПроцесс, ФормируемыеЗадачи);				
				Для каждого ЗадачаОбъект Из ФормируемыеЗадачи Цикл
					бит_ОбщегоНазначения.ЗаписатьЗадачу(ЗадачаОбъект,"Ошибки");
				КонецЦикла; 
			КонецЕсли; 
			
			// При повторном выполнении нижестоящие задачи не создаются заново, а продолжается их выполнение.
			НижестоящиеЗадачи = Задачи.бит_Задача.НижестоящиеЗадачи(Ссылка, "Остановленные");
			Задачи.бит_Задача.ПродолжитьВыполнение(НижестоящиеЗадачи, Истина);			
			
			ДополнительныеСвойства.Удалить("Выполнение");
			
		КонецЕсли; 
		
		Если ДополнительныеСвойства.Свойство("ВыполнениеАвтоматически") Тогда			
			ФормируемыеЗадачи = Новый Массив;
			БизнесПроцессы.бит_Процесс.СоздатьЗадачиПроцесса(БизнесПроцесс, ФормируемыеЗадачи);			
			Для каждого ЗадачаОбъект Из ФормируемыеЗадачи Цикл
				Если ЗадачаОбъект.ТочкаАлгоритма = ТочкаАлгоритма Тогда
					 Продолжить;
				КонецЕсли; 
				бит_ОбщегоНазначения.ЗаписатьЗадачу(ЗадачаОбъект,"Ошибки");
			КонецЦикла; 
		КонецЕсли; 
		
		Если ДополнительныеСвойства.Свойство("ОтменаВыполнения") Тогда			
			// При отмене выполнения нижестоящие задачи переводятся в состояние "Остановлена". 			
			НижестоящиеЗадачи = Задачи.бит_Задача.НижестоящиеЗадачи(Ссылка, "Активные");
			Задачи.бит_Задача.Остановить(НижестоящиеЗадачи, Истина);
			ДополнительныеСвойства.Удалить("ОтменаВыполнения");		
		КонецЕсли; 
		
		Если ВыполнятьАвтоматическиеДействия() Тогда
			// Выполнение автоматических действий фоновым заданием.
			ПараметрыЗадания = Новый Массив;
			ПараметрыЗадания.Добавить(Ссылка);
			
			НаименованиеЗадания = Строка(БизнесПроцесс.УникальныйИдентификатор());
			
			Если ЗначениеЗаполнено(Предмет) Тогда
				бит_УправлениеПроцессами.ВыполнитьАвтоматическиеДействия(Ссылка);
			КонецЕсли; 
		КонецЕсли; 
	КонецЕсли; 
	
	УстановитьПривилегированныйРежим(Ложь);

КонецПроцедуры

 #КонецОбласти
 
#Область СлужебныйПрограммныйИнтерфейс

// Функция определяет является ли данная задача ведущей или нет.
// 
// Возвращаемое значение:
//  Булево.
// 
Функция ЭтоВедущаяЗадача() Экспорт

	флВедущая = Задачи.бит_Задача.ЭтоВедущаяЗадача(ЭтотОбъект);

	Возврат флВедущая;
	
КонецФункции // ЭтоВедущаяЗадача()

// Функция выполняет поиск подчиненного процесса для ведущей задачи.
// 
// Параметры:
//  ПроцессПодчиненный - БизнесПроцессСсылка.бит_Процесс.
// 
// Возвращаемое значение:
//  РезПроцесс - Строка.
// 
Функция НайтиПодчиненныйПроцесс(ПроцессПодчиненный) Экспорт
	
	Если ЗначениеЗаполнено(ПроцессПодчиненный) Тогда
		РезПроцесс = ПроцессПодчиненный;
	Иначе	
		РезПроцесс = Задачи.бит_Задача.НайтиПодчиненныйПроцесс(Ссылка);
	КонецЕсли; 
	
	Возврат РезПроцесс;
	
КонецФункции // НайтиПодчиненныйПроцесс()

#Область ДействияНадЗадачей

// Процедура принимает задачу к исполнению.
// 
Процедура ПринятьКИсполнению()  Экспорт
	
	СостояниеПредыдущее = Состояние;
	
	ДатаНачалаИсполнения = ТекущаяДатаСеанса();	
	Состояние   = Справочники.бит_СтатусыОбъектов.Задача_Принята;
	
	ТекПользователь = Пользователи.ТекущийПользователь();
	Если НЕ ЗначениеЗаполнено(Исполнитель) Тогда
		Исполнитель = ТекПользователь;
	КонецЕсли; 
	
	Если ТекПользователь<>Исполнитель Тогда
		Исполнитель = ТекПользователь;
	КонецЕсли; 
	
КонецПроцедуры // ПринятьКИсполнению()

// Процедура отмечает выполнение задачи.
// 
Процедура ОтметитьВыполнение(Интерактивно = Ложь, ЭтоПеренаправление = Ложь) Экспорт
	
	СостояниеПредыдущее = Состояние;
	
	Если Состояние = Справочники.бит_СтатусыОбъектов.Задача_Создана Тогда
		ПринятьКИсполнению();
	КонецЕсли; 
	
	Если ЭтоПеренаправление Тогда
		
		ТочкаАлгоритма = Справочники.бит_ТочкиАлгоритмов.ПустаяСсылка();
		Алгоритм       = Справочники.бит_АлгоритмыПроцессов.ПустаяСсылка();
		БизнесПроцесс  = БизнесПроцессы.бит_Процесс.ПустаяСсылка();
		ТочкаМаршрута  = Неопределено;
		
	КонецЕсли; 
	
	ДатаОкончанияИсполнения = ТекущаяДатаСеанса();
	Состояние = Справочники.бит_СтатусыОбъектов.Задача_Выполнена;	
	
	Если Интерактивно Тогда
		ВыполнитьЗадачуИнтерактивно();
	Иначе
		ВыполнитьЗадачу();
	КонецЕсли; 
	
КонецПроцедуры // ОтметитьВыполнение()

// Процедура отменяет задачу.
// 
Процедура ОтменитьЗадачу(ЭтоПеренаправление = Ложь) Экспорт
	
	СостояниеПредыдущее = Состояние;
	
	Состояние = Справочники.бит_СтатусыОбъектов.Задача_Отменена;		
	ВыполнитьЗадачу();	
	
КонецПроцедуры // ОтменитьЗадачу() 

// Процедура возобновляет задачу. 
// 
Процедура ВозобновитьЗадачу() Экспорт
	
	СостояниеПредыдущее = Состояние;
	
	Выполнена = Ложь;
	Состояние = Справочники.бит_СтатусыОбъектов.Задача_Создана;
	ДатаНачалаИсполнения    = Дата('00010101');
	ДатаОкончанияИсполнения = Дата('00010101');
	
КонецПроцедуры // ВозобновитьЗадачу() 

// Процедура выполняет остановку задачи.
// 
Процедура Остановить()  Экспорт
	
	СостояниеПредыдущее = Состояние;
	Состояние = Справочники.бит_СтатусыОбъектов.Задача_Остановлена;	
	
	ДополнительныеСвойства.Вставить("Остановить");
	
КонецПроцедуры // ОстановитьЗадачу()

// Процедура возобновляет выполнение задачи после остановки.
// 
Процедура ПродолжитьВыполнение() Экспорт

	Если СостояниеПредыдущее <> Справочники.бит_СтатусыОбъектов.Задача_Остановлена Тогда
		Состояние = СостояниеПредыдущее;
	Иначе	
		Состояние = Справочники.бит_СтатусыОбъектов.Задача_Создана;
	КонецЕсли; 
	
    СостояниеПредыдущее = Справочники.бит_СтатусыОбъектов.Задача_Остановлена;
	
	ДополнительныеСвойства.Вставить("Продолжить");
	
КонецПроцедуры // ПродолжитьВыполнение()

// Процедура возвращает задачу в предыдущее состояние.
// В текущей реализации используется для возврата из состояния Выполнено.
// 
Процедура Вернуться() Экспорт
	
	Выполнена 				= Ложь;
	Состояние               = СостояниеПредыдущее;
	ДатаОкончанияИсполнения = Дата('00010101');	
	
КонецПроцедуры // Вернуться() 

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Процедура сохраняет историю изменения состояния задачи.
// 
Процедура СохранитьИсторию()
	
	// Сохраним историю изменения статуса
	МенеджерЗаписи = РегистрыСведений.бит_ИсторияИзмененияСтатусовОбъектов.СоздатьМенеджерЗаписи();
	МенеджерЗаписи.Объект       = Ссылка;
	МенеджерЗаписи.Период       = ТекущаяДатаСеанса();
	МенеджерЗаписи.ВидСтатуса   = Перечисления.бит_ВидыСтатусовОбъектов.Статус;
	МенеджерЗаписи.Пользователь = Пользователи.ТекущийПользователь();
	МенеджерЗаписи.Статус       = Состояние;
	Попытка
		МенеджерЗаписи.Записать();
	Исключение
		Инфо = ИнформацияОбОшибке();
		ТекстСообщения = НСтр("ru = 'Не удалось сохранить историю изменения статуса объекта ""%1"".
                               |%2';
							   |en = 'Failed to save object status change history ""%1"".
                               |%2'");
		ТекстСообщения = СтрШаблон(ТекстСообщения, ЭтотОбъект, ОбработкаОшибок.КраткоеПредставлениеОшибки(Инфо));
		ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);		
	КонецПопытки;
	
КонецПроцедуры

// Процедура выполняет регистрацию событий для оповещений.
// 
// Параметры:
// 	Булево - отказ от записи объекта.
// 
Процедура ВыполнитьРегистрациюСобытийДляОповещений(Отказ)
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	Если НЕ ПолучитьФункциональнуюОпцию("бит_ИспользоватьМеханизмОповещений") Тогда
		Возврат;	
	КонецЕсли;
	
	ТаблицаОповещений = бит_ОбщиеПеременныеСервер.ЗначениеПеременной("бит_фн_АктивныеОповещения");
	
	// Обработаем события
	Если ТаблицаОповещений <> Неопределено И НЕ ДополнительныеСвойства.Свойство("бит_ОтключитьРегистрациюОповещений") Тогда
		
		// Определим объект системы по метаданным
		ОбъектСистемы = бит_ПраваДоступа.ПолучитьОбъектДоступаПоМетаданным(Метаданные());
		
		ВидСобытия = Перечисления.бит_фн_ВидыСобытийОповещений.ИзмененоСостояниеЗадачи;
		
		// Получим оповещения данного вида для данного объекта.
		СтрОтбор = Новый Структура("ВидСобытия, ОбъектСистемы", ВидСобытия, ОбъектСистемы);
									
		МассивОповещений = ТаблицаОповещений.НайтиСтроки(СтрОтбор);							
		
		Для Каждого СтрокаОповещения Из МассивОповещений Цикл
			
			// Проверим "быстрые" условия.
			АлгоритмСоответствует  = Ложь;
			ТочкаСоответствует	   = Ложь;
			СостояниеСоответствует = Ложь;
			
			// Проверим алгоритм.
			Если НЕ ЗначениеЗаполнено(СтрокаОповещения.АлгоритмПроцесса) Тогда				
				АлгоритмСоответствует = Истина;				
			ИначеЕсли СтрокаОповещения.АлгоритмПроцесса = Алгоритм Тогда				
				АлгоритмСоответствует = Истина;				
			КонецЕсли;
			
			// Проверим точку алгоритма.
			Если НЕ ЗначениеЗаполнено(СтрокаОповещения.ТочкаАлгоритма) Тогда				
				ТочкаСоответствует = Истина;				
			ИначеЕсли СтрокаОповещения.ТочкаАлгоритма = ТочкаАлгоритма Тогда				
				ТочкаСоответствует = Истина;				
			КонецЕсли;
			
			// Проверим состояние.
			Если НЕ ЗначениеЗаполнено(СтрокаОповещения.Статус) Тогда				
				СостояниеСоответствует = Истина;				
			ИначеЕсли СтрокаОповещения.Статус = Состояние Тогда				
				СостояниеСоответствует = Истина;				
			КонецЕсли;
			
			ЕстьСоответствие = АлгоритмСоответствует И СостояниеСоответствует И ТочкаСоответствует;
			
			// Если задано пользовательское условие, проверим его.
			Если ЕстьСоответствие И ЗначениеЗаполнено(СтрокаОповещения.ПользовательскоеУсловие) Тогда				
				СтруктураКонтекст = Новый Структура("ТекущийОбъект", ЭтотОбъект);				
				ЕстьСоответствие = бит_УправлениеПроцессами.ПроверитьПользовательскоеУсловие(СтрокаОповещения.ПользовательскоеУсловие,
				                                                                  СтруктураКонтекст);				
			КонецЕсли;
																			 
			Если ЕстьСоответствие Тогда				
				ЗарегистрироватьСобытиеДляОповещений(ВидСобытия, СтрокаОповещения.Оповещение, ЭтотОбъект);				
			КонецЕсли;  // Событие соответствует отборам
			
		КонецЦикла;
		
	КонецЕсли;
	
КонецПроцедуры

// Процедура регистрирует событие в регистре сведений бит_фн_РегистрацияСобытийОповещений 
// для последующей обработки и создания оповещений.
// 
// Параметры:
//  ВидСобытия  - ПеречислениеСсылка.бит_фн_ВидыСобытийОповещений
//  Оповещение  - СправочникСсылка.бит_фн_Оповещения
//  ИсточникСсылка  - СправочникСсылка, ДокументСсылка.
// 
Процедура ЗарегистрироватьСобытиеДляОповещений(ВидСобытия,Оповещение,ПроцессОбъект)
	
	ПараметрыСобытия			= бит_ОповещенияСервер.НовыеПараметрыСобытия();
	ПараметрыСобытия.ВидСобытия	= ВидСобытия;
	ПараметрыСобытия.Оповещение	= Оповещение;
	ПараметрыСобытия.Объект		= ПроцессОбъект.Ссылка;
	бит_ОповещенияСервер.ЗарегистрироватьСобытиеДляОповещений(ПараметрыСобытия);
	
КонецПроцедуры

Функция ВыполнятьАвтоматическиеДействия()
	
	Если НЕ ЗначениеЗаполнено(БизнесПроцесс) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если НЕ ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "ЭтоНовый", Ложь) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Если ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ДополнительныеСвойства, "ЭтоПереадресация", Ложь) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

#КонецОбласти

#Иначе
  ВызватьИсключение НСтр("ru='Недопустимый вызов объекта на клиенте.';en='Invalid object call on client'");
#КонецЕсли
